/****************************************************************************************************
//=========================================电源接线================================================//
//     LCD模块                STM32单片机
//      VCC          接        DC5V/3.3V      //电源
//      GND          接          GND          //电源地
//=======================================液晶屏数据线接线==========================================//
//本模块默认数据总线类型为SPI总线
//     LCD模块                STM32单片机    
//    SDI(MOSI)      接          PA7         //液晶屏SPI总线数据写信号
//    SDO(MISO)      接          PA6         //液晶屏SPI总线数据读信号，如果不需要读，可以不接线
//=======================================液晶屏控制线接线==========================================//
//     LCD模块 					      STM32单片机 
//       LED         接          PB6         //液晶屏背光控制信号，如果不需要控制，接5V或3.3V
//       SCK         接          PA5         //液晶屏SPI总线时钟信号
//      DC/RS        接          PB7         //液晶屏数据/命令控制信号
//       RST         接          PB8         //液晶屏复位控制信号
//       CS          接          PB9         //液晶屏片选控制信号
//=========================================触摸屏触接线=========================================//
//如果模块不带触摸功能或者带有触摸功能，但是不需要触摸功能，则不需要进行触摸屏接线
//	   LCD模块                STM32单片机 
//      T_IRQ        接          PA1         //触摸屏触摸中断信号
//      T_DO         接          PA8         //触摸屏SPI总线读信号
//      T_DIN        接          PA9         //触摸屏SPI总线写信号
//      T_CS         接          PA10        //触摸屏片选控制信号
//      T_CLK        接          PB5         //触摸屏SPI总线时钟信号
**************************************************************************************************/		
#include "delay.h"
#include "sys.h"
#include "lcd.h"
#include "gui.h"
#include "test.h"
#include "led.h"


int main(void)
{	
	SystemInit();   //初始化RCC 设置系统主频为72MHZ
	delay_init(72);	//延时初始化
	LCD_Init();	    //液晶屏初始化
	
  //循环测试
	while(1)
	{
		main_test(); 		//测试主界面
		//menu_test();     //3D菜单显示测试
		//Test_Color();  		//简单刷屏填充测试
		//Test_FillRec();		//GUI矩形绘图测试
		//Test_Circle(); 		//GUI画圆测试
		//Test_Triangle();    //GUI三角形绘图测试
		//English_Font_test();//英文字体示例测试
		//Chinese_Font_test();//中文字体示例测试
		//Pic_test();			//图片显示示例测试
		//Test_Dynamic_Num(); //动态数字显示
		//Rotate_Test();   //旋转显示测试
		//如果不带触摸，或者不需要触摸功能，请注释掉下面触摸屏测试项
		Touch_Test();		//触摸屏手写测试 
	}
}

